; domain
;My intial and basic cargo transport Domain
;; actions load unload and fly was not implemented by me

(define (domain cargo-transport)

    (:requirements :strips :action-costs :fluents)

    (:predicates
        (In ?obj ?place)
        (At ?obj ?place)
        (Location ?place)
        (Cargo ?obj)
        (Plane ?obj)
        (Airport ?obj)
        (Truck ?obj)

    )

    ; (:functions
    ;     (total-cost) - number
    ; )
    (:action LOAD
        :parameters (?c ?p ?a)
        :precondition (and (At ?c ?a)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (At ?c ?a)) (In ?c ?p))
    )

    (:action UNLOAD
        :parameters (?c ?p ?a)
        :precondition (and (In ?c ?p)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (In ?c ?p)) (At ?c ?a))
    )

    (:action FLY
        :parameters (?p ?from ?to)
        :precondition (and (At ?p ?from)
            (Plane ?p)
            (Airport ?from)
            (Airport ?to))
        :effect (and
            (not (At ?p ?from))
            (At ?p ?to)
            ; (increase (total-cost) 5)
        )
    )
    (:action Drive
        :parameters (?t ?from ?to)
        :precondition (and(At ?t ?from)
            (Truck ?t)
            (Location ?from)
            (Location ?to))
        :effect (and
            (not (At ?t ?from))
            (At ?t ?to)
            ; (increase (total-cost) 5)
        )
    )
    ;; I am keeping the load and unload for planes and trucks seperate for now might concatinate them later (:action Pick-up
    (:action Pick-up
        :parameters (?c ?t ?l)
        :precondition (and (At ?c ?l)
            (At ?c ?l)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l)

        )
        :effect (and (not (At ?c ?l)) (In ?c ?t))
    )
    (:action drop
        :parameters (?c ?t ?l)
        :precondition (and (In ?c ?t)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l))
        :effect (and (not (In ?c ?t)) (At ?c ?l))
    )
)

; problem
;;Simple and basic problem.
;;This problem will get harder as the term goes by and get a better understanding of PDDL.
(define (problem problem2)
    (:domain cargo-transport)
    (:objects
        cargo3 cargo4 truck1 truck2 Manchester Birmingham

    )

    (:init

        (cargo cargo3)
        (Cargo cargo4)
        (Truck truck1)
        (Truck truck2)
        (Location Birmingham)
        (Location Manchester)

        (At cargo3 Birmingham)
        (At cargo4 Manchester)
        (At truck1 Birmingham)
        (At truck2 Manchester)
    )
    (:goal
        (and (At cargo3 Manchester) (At cargo4 Birmingham))
    )
)

; plan
1. (pick-up cargo4 truck2 manchester)
   deleted: (at cargo4 manchester)
   added: (in cargo4 truck2)
   goals met: 0 of 2
2. (drive truck2 manchester birmingham)
   deleted: (at truck2 manchester)
   added: (at truck2 birmingham)
   goals met: 0 of 2
3. (drop cargo4 truck2 birmingham)
   deleted: (in cargo4 truck2)
   added: (at cargo4 birmingham)
   goals met: 1 of 2
4. (pick-up cargo3 truck1 birmingham)
   deleted: (at cargo3 birmingham)
   added: (in cargo3 truck1)
   goals met: 1 of 2
5. (drive truck1 birmingham manchester)
   deleted: (at truck1 birmingham)
   added: (at truck1 manchester)
   goals met: 1 of 2
6. (drop cargo3 truck1 manchester)
   deleted: (in cargo3 truck1)
   added: (at cargo3 manchester)
   goals met: 2 of 2
